<template>
  <div class="container">
    <BreadCrumb />
    <div class="content-event">
      <div class="event-block">
        <h2>隱私權政策</h2>
        <span style="line-height: 150%">
          我們十分重視會員的隱私權，為保障您的權益，
          請您詳閱下列隱私權保護政策內容：<br />
          <br />
          <b>一、資料之蒐集 <br /></b>
          在您使用本網站時，包括：瀏覽網頁、報名參加各類活動、或使用其他網站服務時，將會請您提供您的個人相關資料，包括但不限於行動電話門號、身分證字號、行動電話SIM卡號碼、姓名、電子郵件地址…等。
          <br />
          台灣大哥大基金會保留您所提供的上述資料，也會保留您上網瀏覽或查詢時，在系統上產生的相關記錄，包括IP位址、使用時間、瀏覽器、瀏覽及點選紀錄等。
          <br />
          <br />
          <b>二、資料之保護 <br /></b>
          台灣大哥大基金會會將您的個人資料完整儲存於我們的資料儲存系統中，並以嚴密的保護措施防止未經授權人員之接觸。台灣大哥大基金會的人員均接受過完整之資訊保密教育，充分瞭解用戶資料之保密是我們的基本責任，如有違反保密義務者，將受相關法律及公司內部規定之處分。為了保護您個人資料之完整及安全，保存您個人資料之資料處理系統均已接受妥善的維護，並符合相關主管機關嚴格之要求，以保障您的個人資料不會被不當取得或破壞。
          如因業務需要有必要委託第三者提供服務時，台灣大哥大基金會亦會嚴格要求其遵守保密義務，並且採取必要檢查程序以確定其將確實遵守。
          <br />
          <br />
          <b>三、 資料之使用 <br /></b>
          本網站對於您個人資料之使用，僅在蒐集之特定目的及相關法令規定之範圍內為之。
          除非經由您的同意或其他法令之特別規定本網站絕不會將您的個人資料揭露於第三人或使用於蒐集目的以外之其他用途。
          <br />
          <br />
          <b>四、 連結網頁之使用 <br /></b>
          本網站的網頁可能提供其他網站的網路連結，您也可經由本網站所提供的連結，點選進入其他網站。但本網站並不保護您於該連結網站中的隱私權。
          <br />
          <br />
          <b>五、個人資料之修正 <br /></b>
          當您發現個人資料須修改時，經過身分確認無誤後，您可透過本網站提供之服務管道來修改、更正。
          <br />
          <br />
          <b>六、Cookie之使用 <br /></b>
          為提供您更完善的個人化服務，本網站可能會使用Cookie以紀錄及分析使用者行為，此系統能夠辨識使用者，例如依您偏好的特定種類資料執行不同動作。
          <br />
          <br />
          <b>七、 隱私權保護政策之修正 <br /></b>
          隱私權保護政策將因應需求隨時進行修正，以落實保障使用者隱私權之立意。修正後的條款將刊登於微樂志工網站上。<br />
        </span>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  mounted() {
    document.getElementsByClassName("loading")[0].style.display = "none";
  },
};
</script>
<style lang="scss" scoped>
@import "@/assets/scss/common/_common.scss";
@import "@/assets/scss/page/footer/common.scss";
</style>
