<template>
  <Modal
    class="modal"
    v-model="showModal"
    :ok-text="'完成'"
    width="70%"
    title="服務條款"
    @on-ok="$emit('privacOKHandler', true)"
  >
    <span style="line-height: 150%">
      台灣大哥大基金會(以下稱本基金會)係依照以下條款之約定(以下稱本條款)，提供微樂志工網站（https://www.isharing.tw）服務
      (以下簡稱「本網站服務」)，請詳細閱讀相關內容以保障您的權益；當您開始使用本網站之各項資訊服務時，視為您已確實了解並同意遵守本條款或變更。
      <br />
      <br />
      <b>一、服務內容及費用負擔 <br /></b>
      本基金會係透過網際網路提供各項網路資訊服務，會員得於本基金會網站上進行瀏覽、查詢、申請或使用本基金會各項服務或取得資訊。
      會員如要使用網站服務必須自行配備上網所需之各項電腦設備，以及負擔接上網際網路之費用及電話費用。
      <br />
      <br />
      <b>二、 會員資料及隱私權保護 <br /></b>
      會員須於首次使用網站服務時提供完整詳實且符合真實之個人資料，如登錄之資料嗣後有變更時，應隨時於線上更新。會員所提供之個人資料如有填寫不實、原所登錄之資料已不符合真實而未更新、所提供之個人資料違反或破壞本基金會服務宗旨或有任何誤導之嫌者，本基金會有權拒絕或隨時終止其使用網站服務之一部或全部。<br />
      對於會員所登錄或留存之個人資料，包括會員之姓名、門號、地址、電子郵件地址及其他依法受保護之個人資料，除非經過會員之同意或是因其他法律之規定，本基金會絕對不會對外揭露。
      <br />
      會員同意授權台灣大哥大基金會，得為提供服務及贈獎之目的，提供必需之會員資料給合作夥伴(第三者)做約定範圍內之妥善使用，倘若會員不同意將其資料列於合作夥伴(第三者)產品或服務名單內，可以通知台灣大哥大基金會，於名單中刪除其資料，同時放棄其使用網站報名活動權利。
      <br />
      對於會員所登錄或留存之個人資料，會員同意本基金會、關係企業或合作對象，得於合理之範圍內蒐集、處理、保存、傳遞及使用該等資訊，以提供會員資料統計、關於網路行為之調查研究、提供優惠訊息、或為任何之合法使用等。
      <br />
      基於網際網路之特性，有關會員資料使用與保護之細部約定，會員同意依照隱私權保護政策之規範。隱私權保護政策之內容請參閱台灣大哥大基金會「隱私權政策」。
      <br />
      <br />
      <b>三、會員責任與義務 <br /></b>
      會員使用網站服務應遵守中華民國相關法令及一切國際網際網路規定與慣例，且不得有下列行為：
      <br />
      ‧妨害他人名譽或隱私權。 <br />
      ‧侵害他人營業秘密、商標權、著作權、專利權或其他權利。<br />
      ‧違反其依法律或契約所應負之保密義務。 <br />
      ‧冒用他人名義或散播不實消息。 <br />
      ‧傳輸色情、猥褻或其他違反善良風俗之言論或資訊。<br />
      ‧傳輸或散佈電腦病毒。<br />
      ‧利用本網站從事不法交易行為。 <br />
      ‧擅自複製他人資訊轉售、轉載。 <br />
      ‧擷取非經所有人正式開放或授權之資訊。 <br />
      其他利用本網站為任何違反消費者保護法、公平交易法或其他法令規定之行為。會員行為如涉及不法，除應由其自負法律責任外，本基金會將主動配合相關主管機關調查處理。<br />
      如因會員違背本條款或相關法令，或有侵害他人權利之不法或不當行為，致本基金會或關係企業、受僱人、受託人、代理人及其他相關履行輔助人受有損害或支出費用（包括但不限於因進行民事、刑事及行政程序所支出之訴訟費用及律師費）時，會員應負擔損害賠償責任。
      <br />
      會員同意授權本基金會對會員所公佈、張貼、傳送之任何資料訊息享有公開散佈、發行、重製、修改，編輯、轉載、轉授權、轉售或刪除之權利。
      <br />
      會員同意使用網站服務時，應遵守各該項服務或活動之使用條款或說明，且如該項服務或活動須另行收費或係由本基金會代收資訊服務費者，會員亦應遵守本基金會相關之費率及收費辦法。
      <br />
      <br />
      <b>四、保管及通知義務 <br /></b>
      完成本服務的登記程序之後，您將收到一個密碼及帳號。會員有義務妥善保管使用網站服務時所填寫的本基金會門號與密碼，並為此組門號與密碼登入系統後所進行之一切活動負責。為維護會員自身權益，請勿將門號與密碼洩露或提供予第三人知悉、或出借或轉讓他人使用。若會員發現門號或密碼遭人非法使用或有任何異常破壞使用安全之情形時，應立即通知本基金會，如因此而造成會員權益受損，本基金會不負擔任何法律或賠償責任。<br />
      <br />
      <b>五、服務之刪除或變更 <br /></b>
      本基金會保留隨時新增、修改或刪除網站服務之全部或一部份之權利，且不另行個別通知，會員不得因此而要求任何補償或賠償。
      <br />
      <br />
      <b>六、服務之停止或終止 <br /></b>
      於發生下列情形之一時，台灣大哥大基金會網站有權可以停止、中斷提供服務：<br />
      本網站如發生下列情形之一時，本基金會有權不經通知逕行停止或中斷提供服務，如因此致會員或第三人產生困擾、不便或損害，均不負任何法律責任：
      <br />
      ‧對電子通信設備進行必要之保養及施工時。 <br />
      ‧發生突發性之電子通信設備故障時。 <br />
      ‧由於所申請之電子通信服務因任何原因被停止，無法提供服務時。 <br />
      ‧由於天災等不可抗力之因素致使無法提供服務時。 <br />
      基於網際網路之特性，會員瞭解並同意於使用本基金會網站服務時，應自行採取防護措施，如因本基金會、協力廠商或相關電信業者網路系統軟硬體設備之故障或失靈、人為操作上之疏失而致網站服務全部或一部中斷、暫時無法使用、遲延、或造成資料傳輸或儲存上之漏誤、或遭第三人侵入系統篡改偽造資料時，本基金會不負任何賠償責任。
      <br />
      如會員有違反本條款或相關法令或有其他不當使用之情形發生時，本基金會得不經催告逕行加以限制或終止其使用本基金會網站之權利，會員不得因此要求補償或賠償。
      <br />
      <br />
      <b
        >七、台灣大哥大基金會得依實際執行情形，增加、修改或終止相關活動，並選擇最適方式告知會員。
        <br
      /></b>
      <br />
      <b>八、線上報名參加志工活動行為 <br /></b>
      會員同意其報名行為，以網站所示之電子報名資料為準，如有糾紛，並以該電子資料為認定標準。<br />
      <br />
      <b>九、風險承擔 <br /></b>
      會員保證使用各項網站服務係基於會員的個人意願，並同意自負任何風險，包括因為自本網站下載圖片、資料或自網站服務中獲得之資料，導致其電腦系統損壞或資料流失等情形。<br />
      <br />
      <b>十、擔保責任免除 <br /></b>
      本基金會就各項網站服務，不負擔任何明示或默示之擔保責任，亦不保證各項服務之穩定、安全、無誤、及不中斷。本基金會不保證使用網站服務之結果或經由本基金會網站獲得之資訊符合會員之期望，亦無法保證會員不會因此接觸到不適當之內容。
      <br />
      <br />
      <b>十一、賠償責任限制 <br /></b>
      會員如無法使用本網站服務時，其所致生之任何直接、間接、衍生、或特別損害等，本會均不負任何賠償責任。若會員使用之服務係有價者，本基金會僅於會員所付之有價範圍內負責賠償。但前述賠償責任限制，若依法為不得限制者，則限制規定將不予適用。
      <br />
      <br />
      <b>十二、特別同意事項 <br /></b>
      會員同意絕不使用本基金會網站服務傷害、侵犯、誹謗或攻擊本基金會、本基金會之負責人、員工、顧問、關係企業、廣告主以及相關合作廠商。<br />
      <br />
      <b>十三、權利歸屬 <br /></b>
      本基金會網站上之所有著作及資料，其著作權、專利權、商標、營業秘密、其他智慧財產權、所有權及其他權利，均為本基金會或其合法權利人所有，除事先經本基金會或合法權利人之合法授權外，會員不得擅自重製、傳輸、改作、編輯或以其他任何形式、基於任何目的加以使用，否則應負擔所有法律責任。
      <br />
      <br />
      <b>十四、連結 <br /></b>
      本基金會在所有服務相關網頁上提供之連結方式，可能連結到其他個人、公司或組織之網站。提供該等連結之目的，僅係為便利會員自行蒐集或取得資訊，本基金會對於被連結之該等個人、公司或組織之網站上所提供之產品、服務及資訊，不擔保其真實性、完整性、即時性或可信度，該等個人、公司或組織亦不因此而當然與本基金會有任何僱佣、委任、代理、合夥或其他類似之關係。
      <br />
      <br />
      <b>十五、條款之修正及個別條款之效力 <br /></b>
      本基金會得隨時修正本條款，並隨時透過網站公佈之，修正條款自公佈時起生效。
      <br />
      本條款所定之任何條款，其全部或一部無效時，不影響其他條款之效力。 <br />
      <br />
      <b>十六、準據法及管轄法院 <br /></b>
      會員同意本條款之解釋及效力適用中華民國法律，且如因此涉訟，以台灣台北地方法院為第一審管轄法院。<br />
    </span>
  </Modal>
</template>
<script>
export default {
  props: ["modalShow"],
  data() {
    return {
      showModal: false,
    };
  },
  watch: {
    modalShow(val) {
      this.showModal = val;
    },
    showModal(val) {
      this.$emit("modalHandler", val);
    },
  },
};
</script>
<style lang="scss" scoped>
@import "@/assets/scss/components/member/common.scss";
@import "@/assets/scss/components/modal/common.scss";
</style>
